Repository: hamerstandr/TinyWall
Catalog: TinyWall/SettingsForm.*.resx
Languages: de, hu

# btnCancel.Text
source: لغو
de: Abbrechen
hu: Mégse

# btnOK.Text
source: اعمال
de: Anwenden
hu: Alkalmaz

# txtExceptionListFilter.AccessibleName
source: Filter
hu: Szűrő

# btnAppRemoveAll.Text
source: Remove all
de: Alle entfernen
hu: Mind eltávolít

# btnAppAutoDetect.Text
source: Detect
de: Erkennen
hu: Felderít

# btnSubmitAssoc.Text
source: Submit
de: Senden
hu: Elfogad

# label3.Text
source: Edit the list of applications that you'd like to grant network access. Only applications in this list will be able to communicate. Use the Detect button to let TinyWall detect some software, or add applications manually.
de: Editieren Sie die Liste der Anwendungen, denen Sie Zugriff zum Netzwerk erlauben. Nur Anwendungen von dieser Liste dürfen im Netzwerk kommunizieren. Benutzen Sie den Erkennen-Knopf, damit TinyWall diese Anwendungen erkennt oder fügen Sie die Anwendungen selber hinzu.
hu: Szerkesztheted az alkalmazások listáját. Csak az itt szereplő alkalmazások kapnak hálózati hozzáférést. Használd a Felderít gombot az alkalmazások automatikus detektálásához, vagy add hozzá őket manuálisan.

# btnAppRemove.Text
source: Remove
de: Entfernen
hu: Eltávolít

# btnAppModify.Text
source: Modify
de: Ändern
hu: Módosít

# btnAppAdd.Text
source: Add application
de: Anwendung hinzufügen
hu: Új alkalmazás

# columnApp.Text
source: Application
de: Anwendung
hu: Alkalmazás

# columnType.Text
source: Type
de: Typ
hu: Típus

# columnDetails.Text
source: Details
hu: Részletek

# label4.Text
source: Filter:
hu: Szűrő:

# tabPage3.Text
source: استثناهای برنامه
de: Ausnahmen von Anwendungen
hu: Alkalmazás kivételek

# label5.Text
source: Select special tasks or applications that you'd like to enable on this machine. Note that disabling recommended exceptions can seriously limit the usability and security of your system.
de: Wählen Sie spezielle Aufgaben oder Anwendungen, die Sie auf dieser Maschine erlauben wollen. Merke: Deaktivieren von empfohlenen Ausnahmen kann die Benutzbarkeit und Sicherheit des Systems beeinträchtigen.
hu: Válaszd ki a speciális folymatokat, amiket engedélyezni szeretnél ezen a gépen. Vigyázat, a javasolt kivételek letiltásával veszélyesen csökkentheted a rendszer stabilitását, vagy biztonságát!

# label2.Text
source: Optional
hu: Opcionális

# label1.Text
source: Recommended
de: Empfohlen
hu: Javasolt

# tabPage2.Text
source: استثناهای خاص
de: Spezielle Ausnahmen
hu: Speciális kivételek

# chkDisplayOffBlock.Text
source: Block internet during display power-save
de: Sperre Internet während Monitor im Power-Save
hu: Internet tiltása a monitor alvó állapotában

# chkEnableHotkeys.Text
source: Enable global hotkeys
de: Schnelltasten aktivieren
hu: Gyorsbillentyűk használata

# label11.Text
source: زبان:
de: Sprache:
hu: Nyelv:

# chkEnableBlocklists.Text
source: Enable blocklists
de: Aktiviere die Sperrliste
hu: Blokkoló-lista engedélyezése

# chkLockHostsFile.Text
source: Prevent modifications to hosts file
de: Verhindere Änderungen an der Host-Datei
hu: Host-fájl módosításának tiltása

# chkHostsBlocklist.Text
source: Domain-based malware and ad blocklist
de: Domänenbasierte Malware und Ad-Sperrliste
hu: Domain-alapú malware és reklámblokkoló lista

# chkAutoUpdateCheck.Text
source: Automatically check for updates
de: Prüfe automatisch auf Updates
hu: Frissítések automatikus keresése

# chkBlockMalwarePorts.Text
source: Port-based malware blocklist
de: Portbasierte Sperrliste für Malware
hu: Port-alapú malware blokkoló-lista

# label9.Text
source: برای حذف محافظت از رمز عبور فعال، «تغییر رمز عبور» را علامت بزنید و فیلدهای نوشتاری را خالی بگذارید.
de: Um den Passwortschutz zu deaktivieren wählen Sie Passwortschutz und lassen Sie das Feld frei.
hu: Egy beállított jelszó eltávolításához, kattints a Módosítás-ra, majd hagyd üresen mindkét szövegmezőt.

# label8.Text
source: تایپ مجدد:
de: Wiederholen:
hu: Újra:

# label7.Text
source: رمز عبور:
de: Passwort:
hu: Jelszó:

# chkChangePassword.Text
source: تغییر رمز عبور
de: Passwort ändern
hu: Jelszó módosítása

# groupBox1.Text
source: حفاظت با رمز عبور
de: Passwortschutz
hu: Jelszavas védelem

# chkAskForExceptionDetails.Text
source: Prompt for exception details
de: Frage nach Ausnahmedetails
hu: Kérje be a kivétel részleteit

# tabPage1.Text
source: عمومی
de: Allgemein
hu: Általános

# btnImport.Text
source: Import Settings
de: Importieren
hu: Importálás

# btnExport.Text
source: Export Settings
de: Exportieren
hu: Exportálás

# btnDonate.AccessibleDescription
source: Donate
de: Spenden
hu: Támogatás

# btnDonate.AccessibleName
source: Donation
de: Spende
hu: Támogatás

# label10.Text
source: If you like and use this free program, please consider donating to cover hosting, hardware and software costs.
de: Wenn Sie dieses Programm mögen und benutzen sollten Sie über eine Spende nachdenken. Die Spenden kommen den Hosting-, Hardware- und Softwarekosten zu Gute.
hu: Ha tetszik és használod a programot, kérlek támogasd a fejlesztését.

# label6.Text
source: All rights reserved.
de: Alle Rechte vorbehalten.
hu: Minden jog fentartva.

# btnUpdate.Text
source: Update
hu: Frissítés

# btnWeb.Text
source: Visit webpage
de: Besuche die Website
hu: Honlap megtekintése

# tabPage4.Text
source: تعمیر و نگهداری
de: Wartung
hu: Karbantartás

# $this.Text
source: تنظیمات دیوار آتش TinyWall
de: TinyWall Firewall Einstellungen
hu: TinyWall Firewall Beállítások

# lblLinkLicense.Text
source: Licence
de: Lizenz

# groupBox2.Text
source: About
de: Über
